# Check if it is a square or rectangle by taking length and breadth from the user

In [2]:
l = int(input("Enter length :"))
b = int(input("Enter breadth :"))
if (l == b):
    print ("It is a sqaure")
else:
    print ("It is a rectangle")

Enter length :45
Enter breadth :67
It is a rectangle

# Short hand if & if..else

In [3]:
a =2
b = 330
print ("A") if a > b else print ("B")

B

# Take 2 integer values and check whether it is greater, smaller or equal using short hand if & if..else

In [4]:
a = int(input("Enter a :"))
b = int(input("Enter b:"))
print ("a is greater") if a > b else print ("b is greater") if b > a else print ("Equal")

Enter a :67
Enter b:54
a is greater

# Calculate sum of all the numbers from 1 to n, where n is user defined number

In [5]:
n = int(input("Enter a number:"))
sum_1 = 0
for i in range (1, n+1):
    sum_1 = sum_1 + i
print ("Sum of all the numbers from 1 to {}:".format(n), sum_1)

Enter a number:56
Sum of all the numbers from 1 to 56: 1596

# Calculate sum of all the numbers from 1 to n, where n is user defined number, using while loop

In [6]:
n = int(input("Enter a number:"))
sum_1 = 0
i = 0
while i <= n:
    sum_1 = sum_1 + i
    i = i + 1
print (sum_1)

Enter a number:21
231

# Take user defined list which contains all types of data and print the list in ascending and descending order

In [7]:
l = []
n = int(input("Enter size of the list:"))
for i in range (n):
    a = str(input("Enter elements :")) 
    l.append (a)
print (l)
l.sort()
print ("Sorted in ascending order :", l)
l.sort(reverse = True)
print ("Sorted in descending order :", l)

Enter size of the list:4
Enter elements :1
Enter elements :2
Enter elements :3
Enter elements :4
['1', '2', '3', '4']
Sorted in ascending order : ['1', '2', '3', '4']
Sorted in descending order : ['4', '3', '2', '1']

# Print a list with numbers less than 5 using list comprehension

In [8]:
newlist = [i for i in range(20) if i < 5]
print (newlist)

[0, 1, 2, 3, 4]

# Take 4 lists and put the first 3 dictionaries into the 4th one

In [10]:
d1 = {"name":"Srijan", "age":22}
d2 = {"college":"KIIT", "group":"A"}
d3 = {"subject":4, "lab":3}
d4 = {}
d4.update(d1)
d4.update(d2)
d4.update(d3)
print ("Merged dictionary:", d4)

Merged dictionary: {'name': 'Srijan', 'age': 22, 'college': 'KIIT', 'group': 'A', 'subject': 4, 'lab': 3}

# Create a dictionary of address using "name", "address", "street", "state" and print all the values using string formater

In [12]:
d1 = {"name":"Srijan", "address":"Kanpur", "street":"Govind Nagar", "state":"UP"}
print ("Name: {}, Address: {}, Street: {}, State: {}".format(d1['name'], d1['address'], d1['street'], d1['state']))

Name: Srijan, Address: Kanpur, Street: Govind Nagar, State: UP

# Write a program to multiply all elements of dictionary

In [13]:
FruitDict = {'Apple': 10, 'banana': 5,'orange':4,'Guava':6} 
mult = 1
for i in FruitDict.values():
    mult = mult * i
print (mult)

1200

# Create a user input dictionary having two key:value pair and check whether one of the key given by you is pesent in the dictionary 
**Input:- {hari:59,sunny:60} Checking_input:- hari  
Output:- hari=59**

In [16]:
d1 = {}
print ("Enter 2 key value pairs")
for i in range(2):
    key = input()
    value = int(input())
    d1[key] = value
print (d1)
st = input("Enter the key you want to search:")
if (st in d1):
    print (st, "=", d1[st])

Enter 2 key value pairs
Srijan
4799
Shirsha
2700
{'Srijan': 4799, 'Shirsha': 2700}
Enter the key you want to search:Shirsha
Shirsha = 2700

# Write a Python program to sort a list of tuples using Lambda. 
**Input: [('Eng', 88), ('Sci', 90), ('Maths', 97), ('Sst', 82)]
Output: [('Sst', 82), ('Eng', 88), ('Sci', 90), ('Maths', 97)]**

In [17]:
l = [('Eng', 88), ('Sci', 90), ('Maths', 97), ('Sst', 82)]
l.sort(key = lambda x : x[1])
print (l)

[('Sst', 82), ('Eng', 88), ('Sci', 90), ('Maths', 97)]

# Define a function with two arguments a and b. 
**Check if a is equal to 1 then return 'coming from if',check if b is equal to 1 ,then return 'coming from elif' otherwise return 'no condition is satisfied'**

In [18]:
def check(a, b):
    if (a == 1):
        return ("Coming from if")
    elif (b == 1):
        return ("Coming from elif")
    else:
        return ("No condition is satisfied")

print(check(1, 6))
print(check(3, 1))
print(check(0, 0))

Coming from if
Coming from elif
No condition is satisfied

# Take a Dictionary as given in input.Find the average of phy subject from the dict using function 
**Input:- dict={1:{'name':'Ram','Mark':{'phy':56,'chem':78}},2:{'name':'Hari','Mark':{'phy':76,'chem':88}}} 
Output:- 66.0**

In [19]:
def avg(x):
    s = 0
    count = 0
    for i in x.values():
        s = s + i['Mark']['phy']
        count = count + 1
    av = s / count
    return av

dict={1:{'name':'Ram','Mark':{'phy':56,'chem':78}},2:{'name':'Hari','Mark':{'phy':76,'chem':88}}}
print (avg (dict))

66.0

# Add the elements present in a tuple using function

In [20]:
def addTuple(t):
    sum_1 = 0
    for i in t:
        sum_1 = sum_1 + i
    return sum_1

a = (4, 5, 6, 7, 8, 9)
print ("Adding the elements:", addTuple(a))

Adding the elements: 39

# Create a list of tuple using zip and then sort the list according to first element and second element using lambda function

In [21]:
l1 = [56, 24, 63, 90]
l2 = [12, 85, 89, 12]
l3 = list(zip(l1, l2))
print ("List of tuples:", l3)
l3.sort (key = lambda x: x[0])
print ("Sorted according to first element:", l3)
l3.sort (key = lambda x : x[1])
print ("Sorted according to second element:", l3)

List of tuples: [(56, 12), (24, 85), (63, 89), (90, 12)]
Sorted according to first element: [(24, 85), (56, 12), (63, 89), (90, 12)]
Sorted according to second element: [(56, 12), (90, 12), (24, 85), (63, 89)]

# Create a file and print 'file not writable' using error handling

In [22]:
f = open('file1.txt', 'x')

In [23]:
f = open ('file1.txt', 'r')
try:
    f.write ("I am using python")
except:
    print ("File is not writable")
f.close()

File is not writable

In [25]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [26]:
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [27]:
data.iloc[[0, 2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       C   Mumbai      F          yellow

In [28]:
data.iloc[[0, 2], [1, 3]]

  section gender
0       A      M
2       C      F

In [29]:
data.iloc[1:3]

   age section    city gender favourite_color
1   22       S    Pune      F             NaN
2   13       C  Mumbai      F          yellow

In [30]:
data.iloc[1:3, 2:4]

     city gender
1    Pune      F
2  Mumbai      F

**Qno- By importing required module create a dataframe.Display the dataframe {'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai','Delhi','Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]}**

**After creating perform the following set of questions:- 1.selecting cars with brand 'Maruti' and Mileage > 25 2.selecting range of rows from 2 to 5 3.updating values of Mileage if Year < 2015 4.selecting 0th, 2th, 4th, and 7th index rows 5.selecting rows from 1 to 4 and columns from 2 to 4**

In [31]:
df = pd.DataFrame ({'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 
                    'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019], 
                    'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000], 
                    'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai','Delhi','Mumbai','Chennai', 'Ghaziabad'], 
                    'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]})

In [32]:
display(df)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24


# 1.selecting cars with brand 'Maruti' and Mileage > 25

In [33]:
display(df.loc [(df['Brand'] == 'Maruti') & (df['Mileage'] > 25)])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

# 2.selecting range of rows from 2 to 5

In [34]:
display(df.loc[2:5])

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

# 3.updating values of Mileage if Year < 2015

In [35]:
df.loc[(df['Year']) < 2015, ['Mileage']] = 30
display(df)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       30
1   Hyundai  2014       30000      Delhi       30
2      Tata  2011       60000     Mumbai       30
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       30
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       30
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24


# 4.selecting 0th, 2th, 4th, and 7th index rows

In [36]:
display(df.iloc[[0, 2, 4, 7]])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       30
2    Tata  2011       60000   Mumbai       30
4  Maruti  2012       10000   Mumbai       30
7    Tata  2018       15000  Chennai       21

# 5.selecting rows from 1 to 4 and columns from 2 to 4

In [37]:
display(df.iloc[1:5, 2:5])

   Kms Driven    City  Mileage
1       30000   Delhi       30
2       60000  Mumbai       30
3       25000   Delhi       26
4       10000  Mumbai       30

**Qno-By importing required module create a dataframe.Display the dataframe {'age':[30, 2, 12, 4, 32, 33, 69], 'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia']**

**After creating perform the following set of questions:- 1.selecting column penelope 2.selecting columns cornelia,jane,dean 3.selecting columns from aaron upto dean 4.selecting 4th index column 5.selecting rows from 1 to 4 and 2nd column**

In [38]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69], 
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 
                   'height':[165, 70, 120, 80, 180, 172, 150], 
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, 
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] )

In [39]:
display(df)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX


# 1.selecting column penelope

In [40]:
display(df.loc[['Penelope']])

          age  color   food  height  score state
Penelope    4  white  Apple      80    3.3    AL

# 2.selecting columns cornelia,jane,dean

In [41]:
display(df.loc[['Cornelia', 'Jane', 'Dean']])

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

# 3.selecting columns from aaron upto dean

In [42]:
display(df.loc['Aaron':'Dean'])

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK


# 4.selecting 4th index column

In [43]:
display(df.iloc[:, [3]])

           height
Jane          165
Nick           70
Aaron         120
Penelope       80
Dean          180
Christina     172
Cornelia      150

# 5.selecting rows from 1 to 4 and 2nd column

In [44]:
display(df.iloc[0:4, [2]])

           food
Jane      Steak
Nick       Lamb
Aaron     Mango
Penelope  Apple